case_up_half_cube_04/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.76e-6;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }

    right
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    // Birch 1987: eps = Cmu^(3/4)*k^(3/2)/l, l=0.07*D_n=0.07*0.02853=1.998e-3 m
    source
    {
        type            fixedValue;
        value           uniform 1.530e8;
    }

    nozzle_wall_rest
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}
